{
    "06/20/2020": [
        {
            "title": "So I took off her shirt. Then she said, \"Take off my skirt.\" I took off her skirt. \"Take off my shoes.\" I took off her shoes. \"Now take off my bra and panties.\" and so I took them off.",
            "text": "\n\nThen she looked at me and said, \"I don't want to catch you wearing my things ever again.\"",
            "joke_id": 1
        },
        {
            "title": "At the bar last night, a woman got her nipple pierced right in front of me",
            "text": " \n\n. On a related note...…………………. I suck at darts.",
            "joke_id": 2
        },
        {
            "title": "How do you think the unthinkable?",
            "text": "With an itheberg",
            "joke_id": 3
        },
        {
            "title": "In order to stop accusations of racism, Trump decides to hire a Mexican immigrant",
            "text": "However, he doesn't feel confortable having him as an employee and calls him over in his office.\n\nJuan: \"Why you call me, jefe ?\"\n\nTrump: \"You're fired!\"\n\n\nJuan: \"Que ?! Why ?!!\"\n\n\nTrump: \"Because....uh... Because you didn't finish high school!\"\n\nJuan: \"Oh, no problemo, jefe! Yo go y finish high school and return to work!\"\n\n\nJuan finishes high school, comes back to work and Trump calls him again.\n\n\nJuan: \"Si, jefe ?\"\n\nTrump: \"You're fired!\"\n\n\nJuan: \"Que ?! Why ?! Yo finish high school !\"\n\n\nTrump: \"Yeah, but.... um.... you didn't finish college!\"\n\n\nJuan: \"No problemo! Yo finish college too Jefe!\"\n\n\nJuan finishes college too and comes back to work again only for Trump to call him again.\n\n\nJuan: \"What now, jefe ?\"\n\n\nTrump: \"You're fired!\"\n\n\nJuan: \"Que?! Why ?! Yo finish both high school y college! Why you fire me this time ?\"\n\n\nTrump: \"Because.... uh....um. Ok, here's the truth! You're a Mexican immigrant and I don't like you working here!\"\n\n\nJuan: \"No problemo! Yo become Americano and come back to work!\"\n\n\nSo Juan gains American citizenship, learns perfect English, converts to Protestantism, embraces American culture, changes his name to John and comes back to work.\n\nOnly for Trump to call him again.\n\n\nJohn: \"Why do you wanna see me, boss ?\"\n\nTrump: \"You're fired!\"\n\n\nJohn:\"What! Why ? I finished high school, I finished college, I became an American! What more do you want from me ?!\"\n\n\nTrump: \"Well, the last 3 times I fired you, my critics accused me of being a racist for always firing the only Mexican worker. So in order  to prove them wrong, I decided to fire an American this time.\"",
            "joke_id": 4
        },
        {
            "title": "I managed to lose my rifle when I was in the army. I had to pay $855 to cover the loss.",
            "text": "I’m starting to understand why a Navy captain always goes down with his ship.",
            "joke_id": 5
        },
        {
            "title": "A man notices his wife's butt is getting big",
            "text": "\nI bet your butt is as big as my grill.\"\n\nHis wife rolls her eyes, but he gets a tape measure,\nmeasures her bottom, measures the grill, and teases\nher that they're about the same size.\n\nThat night, he tries to see if he can get lucky. \"Not\ntonight,\" says his wife.\n\nHe asks her why not, to which she responds, \"Do you\nreally think I'm going to fire up this big-ass grill for\none little weiner?\"",
            "joke_id": 6
        },
        {
            "title": "My dentist asked me how long it had been since I flossed",
            "text": "I said “you should know that, you were there”.",
            "joke_id": 7
        },
        {
            "title": "A woman pregnant with triplets was shot in the belly three times.",
            "text": "She was rushed to the hospital and was assessed. The doctor told her “each one of your babies has been shot, but the good news is that the wounds are not life threatening. And even better news where they were shot, the bullets will come out on their own.”  The mother is patched up and gives birth a month later to two healthy girls and one healthy boy. \n\nEighteen years later one of the girls ran up to their mother in tears, “mom!  I was having a tinkle and a bullet came out of me!”  Mom calmed the daughter down and explained what happened before she was born.  The next day the second of the two girls ran to her mother crying, “Mom! I went to have a tinkle and this bullet came out of me!” Again, the mother calmed her daughter down and explained what happened to her before she was born.  \n\nThe next day the son ran to his mother in a panic, “Mom!  MOM!!!”  Mother replies, “let me guess, you went to tinkle and a bullet came out?”  Son replies, “No!  I was jerking off and I shot the dog!!!!”",
            "joke_id": 8
        },
        {
            "title": "I was dreaming about having diarrhea and then I woke up.",
            "text": "That's when shit got real.",
            "joke_id": 9
        },
        {
            "title": "Why can't you email a photo to a Jedi?",
            "text": "because attachments are forbidden",
            "joke_id": 10
        },
        {
            "title": "My wife just completed a 40 week body building program this morning",
            "text": "It's a girl and weighs 7lbs 12 oz",
            "joke_id": 11
        },
        {
            "title": "I saw a midget wearing a t-shirt with the slogan \"I hate black people\" on it...",
            "text": "I thought to myself... \"Well that's a little racist\"",
            "joke_id": 12
        },
        {
            "title": "An Engineer goes to Hell.",
            "text": "The first thing he notices is, it's awful hot. So he goes and checks the A/C system, and notices a missing belt. He replaces it, and soon it's a cool 78F. \n\nThe next thing he notices, is that all the TVs are showing nothing but static. He checks the satellite dish, and sees it's misaligned. He makes some adjustments, and soon every TV is showing 500 channels of HD entertainment.\n\nFinally, he goes to the bar, but the bartender says they haven't had beer for ages. The Engineer checks the tap, finds a faulty valve, and replaces it. \n\nGod looks down and says, \"What the Hell's going on down here? Everybody's having fun!\"\n\nSatan says, \"Well ever since you sent us that Engineer, things just seem to get better and better.\"\n\n\"An Engineer?\" says God. \"There must be some mistake. I would never send you an Engineer! I demand you send him back.\"\n\nBut Satan refuses.\n\n\"If you don't send him back,\" says God, \"I'll sue!\"\n\nSatan looks at him, astonished.\n\n\"Where are YOU going to find a LAWYER?\"",
            "joke_id": 13
        },
        {
            "title": "My favourite joke :)",
            "text": "A guy driving a nice new Mercedes parks along the side of a road and opens the door but a car drives by at the same time and rips the door off the car before coming to a stop. \n\nThe Mercedes driver runs up to the car and starts yelling at the driver: ‘look at what you’ve done to my brand new Mercedes, it’s completely wrecked!’\n\nThe other driver replies: ‘wow you’re a real capitalist pig, you care so much about your stupid car you haven’t even realised your arm has been ripped off your body!’\n\nHearing this the Mercedes driver panics and shouts: ‘oh fuck, my Rolex!’",
            "joke_id": 14
        },
        {
            "title": "A man was shipwrecked on a remote island. Although he had plenty of food and water, there was nothing for him to do except play with himself.",
            "text": "After many years, even that became so monotonous that he couldn't even get an erection. Now, completely without any happiness, his sanity began to slip away.\n\nOne morning, as he is lying on the beach, he thinks he sees a ship in the distance. He quickly starts a fire, then throws wet seaweed on top until smoke is billowing high in the air. The ship starts to come his way!\n\nHe gets all excited and thinks, \"Finally! I'm going to be saved! The first thing I want is to take a long, hot shower. Then they're going to give me some clothes and I'm going to go upstairs and have a nice dinner. I will find a nice lady to dance with, then I will take to her cabin and we can kiss and I can fondle her body. She'll start to take off her clothes and she'll be wearing red silk panties!\"\n\nAt this, he gets an erection. He slips his hand into his shorts, grabs his pecker, and yells, \"Ha Ha Ha!! I fooled you! I lied about the ship!\"",
            "joke_id": 15
        },
        {
            "title": "Rolled my first joint last night.",
            "text": "Fuck, my ankle hurts this morning.",
            "joke_id": 16
        },
        {
            "title": "A frog a bank and a loan",
            "text": "A frog goes into a bank and approaches the teller. He can see from her nameplate that the teller's name is Patricia Whack. So he says, \"Ms. Whack, I'd like to get a loan to buy a boat and go on a long vacation.\"\nPatti looks at the frog in disbelief and asks how much he wants to borrow.\nThe frog says $30,000.\nThe teller asks his name and the frog says that his name is Kermit Jagger, his dad is Mick Jagger, and that it's OK, he knows the bank manager.\nPatti explains that $30,000 is a substantial amount of money and that he will need to secure some collateral against the loan. She asks if he has anything he can use as collateral.\nThe frog says, \"Sure. I have this,\" and produces a tiny pink porcelain elephant, about half an inch tall, bright pink and perfectly formed.\nVery confused, Patti explains that she'll have to consult with the manager and disappears into a back office.\nShe finds the manager and says \"There's a frog called Kermit Jagger out there who claims to know you and wants to borrow $30,000. He wants to use this as collateral.\" She holds up the tiny pink elephant. \"I mean, what the heck is this?\"\nThe bank manager looks back at her and says: \"It's a knick knack, Patti Whack. Give the frog a loan. His old man's a Rolling Stone\"",
            "joke_id": 17
        },
        {
            "title": "A guy walks into a bar with his pet monkey, orders a drink and while he’s drinking it, the monkey jumps around all over, grabs some olives off the bar, eats them, grabs some sliced limes, eats them, jumps up on the pool table, grabs a cue ball, sticks it in his mouth and swallows it whole...",
            "text": "\n\nThe bartender screams at the guy, “Did you see what your monkey just did?”\n\nThe guy says, “No, what?”\n\n“He just ate the cue ball off my pool table, whole!” says the bartender.\n\n“Yeah, that doesn’t surprise me.” replied the patron. “He eats everything in sight. I’ll pay for the cue ball and stuff.”\n\nHe finishes his drink, pays his bill, and leaves.\n\nTwo weeks later he’s in the bar again and he has his monkey with him.\n\nHe orders a drink and the monkey starts running around the bar again.\n\nWhile the man is drinking his drink, the monkey finds a maraschino cherry on the bar.\n\nHe grabs it, sticks it up his butt, pulls it out, and eats it.\n\nThe bartender is disgusted.\n\n“Did you see what your monkey did now?”, he asks.\n\n“Now what?”, responds the patron.\n\n“Well, he stuck a maraschino cherry up his butt, then pulled it out and ate it!” says the barkeeper.\n\n“Yeah, that doesn’t surprise me.” replied the patron. “He still eats everything in sight, but ever since he ate that cue ball he measures everything first!”",
            "joke_id": 18
        },
        {
            "title": "TRUMP IS NOT MY PRESIDENT",
            "text": "Neither was Obama. Actually I live in India.",
            "joke_id": 19
        },
        {
            "title": "Two old stones are up late one night.",
            "text": "It’s getting late and one stonier asks the other “What time is it?”\n\n“I dunno but hand me my tuba and I’ll tell you”\n\n“You can tell time with a tuba?” \n\n\n“Yah it’s a magic tuba”\n\nHe lets out a long, low note and suddenly through the walls you hear\n\n“WHO THE FUCK IS PLAYING A TUBA AT 3 AM!”",
            "joke_id": 20
        },
        {
            "title": "A m‌‌other w‌‌as w‌‌alking d‌‌own t‌‌he h‌‌all w‌‌hen s‌‌he h‌‌eard a‌‌ h‌‌umming s‌‌ound c‌‌oming f‌‌rom h‌‌er d‌‌aughter's b‌‌edroom. W‌‌hen s‌‌he o‌‌pened t‌‌he d‌‌oor s‌‌he f‌‌ound h‌‌er d‌‌aughter n‌‌aked o‌‌n t‌‌he b‌‌ed w‌‌ith a‌‌ v‌‌ibrator.",
            "text": "What a‌‌re y‌‌ou d‌‌oing?\", s‌‌he e‌‌xclaimed.\n\nThe d‌‌aughter r‌‌eplied, \"‌‌I'm 3‌‌5 a‌‌nd s‌‌till l‌‌iving a‌‌t h‌‌ome w‌‌ith m‌‌y p‌‌arents a‌‌nd t‌‌his i‌‌s t‌‌he c‌‌losest I‌‌'ll e‌‌ver g‌‌et t‌‌o a‌‌ h‌‌usband.\"\n\nLater t‌‌hat w‌‌eek t‌‌he f‌‌ather w‌‌as i‌‌n t‌‌he k‌‌itchen a‌‌nd h‌‌eard a‌‌ h‌‌umming s‌‌ound c‌‌oming f‌‌rom t‌‌he b‌‌asement. W‌‌hen h‌‌e w‌‌ent d‌‌ownstairs, h‌‌e f‌‌ound h‌‌is d‌‌aughter n‌‌aked o‌‌n t‌‌he s‌‌ofa w‌‌ith h‌‌er v‌‌ibrator.\n\n\"What a‌‌re y‌‌ou d‌‌oing?\", h‌‌e e‌‌xclaimed.\n\nThe d‌‌aughter r‌‌eplied, \"‌‌I'm 3‌‌5 a‌‌nd s‌‌till l‌‌iving a‌‌t h‌‌ome w‌‌ith m‌‌y p‌‌arents a‌‌nd t‌‌his i‌‌s t‌‌he c‌‌losest I‌‌'ll e‌‌ver g‌‌et t‌‌o a‌‌ h‌‌usband.\"\n\nA c‌‌ouple o‌‌f d‌‌ays l‌‌ater t‌‌he m‌‌other h‌‌eard t‌‌he h‌‌umming s‌‌ound a‌‌gain, t‌‌his t‌‌ime i‌‌n t‌‌he l‌‌iving r‌‌oom. I‌‌n t‌‌here, s‌‌he f‌‌ound h‌‌er h‌‌usband w‌‌atching t‌‌he S‌‌uper B‌‌owl o‌‌n t‌‌elevision w‌‌ith t‌‌he v‌‌ibrator b‌‌uzzing a‌‌way b‌‌eside h‌‌im.\n\n\"What a‌‌re y‌‌ou d‌‌oing?\", s‌‌he e‌‌xclaimed.\n\n\"Watching t‌‌he g‌‌ame w‌‌ith m‌‌y s‌‌on-in-law\", he r‌‌eplied.",
            "joke_id": 21
        },
        {
            "title": "I made a compilation of my favorite 10 jokes from this sub. The first 9 are great but #10 is fucking gold.",
            "text": "1. Great \n\n2. Great\n\n3. Great\n\n4. Great\n\n5. Great\n\n6. Great \n\n7. Great\n\n8. Great\n\n9. Great\n\n10. Fucking Gold.",
            "joke_id": 22
        }
    ]
}